yamaxgucci/esp32-os/sdkconfig.defaults.esp32s3
# ArgonOS - ESP32-S3 defaults (primary target).
#
# These assume an N16R8 style module: 16 MB flash, 8 MB octal PSRAM.
# Boards with quad PSRAM need CONFIG_SPIRAM_MODE_QUAD instead; that lives in
# the board pack, not here.

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# PSRAM stays out of the general malloc pool: ArgonOS hands it out through
# per-process arenas and the executable app-text arena.
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# Deliberately NOT enabled: these copy the kernel's own code and constants into
# PSRAM at boot, which costs boot time and PSRAM and buys nothing here - both
# flash and PSRAM are reached through the same cache.  They are also unrelated
# to the application loader, which maps PSRAM into the instruction bus itself.
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS
# CONFIG_SPIRAM_RODATA

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# 32 KB of instruction cache instead of the default 16.  Interpreters - the
# emulators' inner loops above all - do not fit in 16 KB and thrash it, and any
# .AXE larger than the code arena executes from flash through this cache.  The
# 16 KB comes out of internal SRAM, which is the price.
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# 192 KB of executable arena, the Kconfig maximum.  The Mega Drive image is
# 129 KB of code and the sound block is still to come, so the alternative would
# be flash XIP for the whole emulator plus a `hot_text` split to pull the inner
# loops back into SRAM - a format change to buy what this line buys outright.
# The cost is real and permanent: the arena is reserved at link time whether an
# app is running or not, so this is 128 KB the internal heap never sees.
CONFIG_ARGON_APP_ARENA_KB=192

# Memory protection off, because on this chip it protects against the loader.
#
# Espressif turns it on by default for the S3, and what it forbids is a data
# store to an instruction-RAM address - which is exactly what placing an image
# in the code arena is.  Every .AXE died the same way on the board: a cache
# error with no cause the handler could name, at the first word copy_image
# writes, whether the image was 392 bytes or 36 KB and whether the arena was
# 48 KB or 192.
#
# This line belongs to the chip and not to the board, which is why it is here
# rather than in sdkconfig.esp32s3.board: any real S3 walks into it, and the
# emulator does not model the permission bits, so leaving the two targets
# configured differently would mean the thing being measured is not the thing
# being shipped.  The system's own model settles the trade: an application owns
# the machine, and a machine that forbids writing the application into memory
# cannot run one.  The D/IRAM arena is the only memory that is writable and
# executable at once - see the comment over s_arena in loader.c.
CONFIG_ESP_SYSTEM_MEMPROT_FEATURE=n

# Sound, which on this chip means I2S and nothing else: the S3 has no
# converters of its own, so the output is a codec on three pins somebody
# soldered.  Built in even for the emulator, which has no I2S at all, because
# the alternative is a driver that only one target compiles - and a build that
# nothing builds is a build that rots (pitfall 30, and it cost four sound
# paths).  It costs image space and no RAM: without [audio] pins in BOARD.CFG
# present() answers no, /dev/pcm0 is never registered, and the machine keeps
# the mute sink it had.
CONFIG_ARGON_ENABLE_AUDIO=y

# UART0 is the one console every board and QEMU agree on, and the ROM
# bootloader already talks there, so early output is not split across two
# devices.  USB-serial-JTAG becomes an additional console endpoint at runtime
# once the console multiplexer exists.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
